Repository: theironrobin/siglo
Catalog: po/*.po
Languages: nl

source: Multi-Device Mode
nl: Meerdere apparaten

source: Manual OTA File
nl: Eigen ota-bestand

source: Scanning...
nl: Bezig met zoeken…

source: default scan pass text
nl: standaard scantekst

source: Tag:
nl: Label:

source: Tag
nl: Label

source: Asset:
nl: Waarde:

source: Cancel
nl: Annuleren

source: Flash It!
nl: Flashen!

source: Time Sync
nl: Tijdsynchronisatie

source: Make sure InfiniTime is ON but NOT connected To check, go to Settings->Bluetooth->Devices Might take a few scans.
nl: Zorg dat je smartwatch met InfiniTime is opgestart, en dat het NIET is verbonden met bluetooth Controleer dit via Settings → Bluetooth → Devices Wellicht moet je een paar keer opnieuw zoeken.

source: Rescan
nl: Opnieuw zoeken
